6 Лабораторная работа 1 часть 3 задание
3. Написать программу, которая проверяет, является ли введенная с клавиатуры строка целым числом. 
Рекомендуемый вид экрана во время выполнения программы приведен ниже (данные, введенные 
пользователем, выделены полужирным шрифтом).
Введите число и нажмите <Enter>
-> 23.5
Введенная строка не является целым числом.
//====================================================================================================
#include <stdio.h> /// Стандартная библиотека Си ввода-вывода
#include <windows.h> /// Библиотека для работы с системными функциями

void isItAnInteger (char *inputString)
{
    int booleanVariable; /// Булевая переменная (Совпадает ли элемент под индексом i из строки введённой пользователем с массивом цифр)
    int booleanForStringIsIntegerNumber = 1; /// (True)
    char arrayDigits[] = "1234567890"; /// Массив цифр
    for (int i = 0; inputString[i] != '\0'; i++) /// Выполнять пока не конец строки. '\0' - Тернирующий ноль (Означает конец строки)
    {
        booleanVariable = 0; /// False
        for (int j = 0; arrayDigits[j] != '\0'; j++) /// Выполнять пока не конец строки. '\0' - Тернирующий ноль (Означает конец строки)
        {
            if (inputString[i] == arrayDigits[j])
                booleanVariable = 1; /// (True)
        }
        if (booleanVariable == 0)
        {
            printf ("Введенная строка не является целым числом");
            booleanForStringIsIntegerNumber = 0; /// (False)
        }
    }
    if (booleanForStringIsIntegerNumber == 1)
        printf ("Введёная строка является целым числом");
}

int main()
{
    system ("chcp 1251"); /// Устанавливаем кодовую страницу 1251 (Локализуем русский язык) (Устанавливаем кодировку windows-1251)
    char str[100]; /// Объявляем строку на 100 символов.
    printf ("Введите число и нажмите <Enter>\n-> ");
    gets (str); /// Функция gets считывает символы из стандартного потока ввода до символа новой строки n
    isItAnInteger (str);
    return 0;
}
//====================================================================================================